In [1]:
import pandas as pd

In [2]:
data_series = pd.Series([1, 2, 3, 4])
data_series

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
index = ["i1", "i2", "i3", "i4"]

In [4]:
data_series = pd.Series([1, 2, 3, 4], index)

In [5]:
data_series

i1    1
i2    2
i3    3
i4    4
dtype: int64

In [6]:
data_series["i1"]

1

In [7]:
data_series[:2]

i1    1
i2    2
dtype: int64

In [9]:
calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories, index = ["day1", "day2"])

myvar

day1    420
day2    380
dtype: int64

In [10]:
myvar = pd.Series(calories)
myvar

day1    420
day2    380
day3    390
dtype: int64

# DataFrame

In [11]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data)
df

   calories  duration
0       420        50
1       380        40
2       390        45

In [12]:
df.loc[1]

calories    380
duration     40
Name: 1, dtype: int64

In [13]:
df.calories

0    420
1    380
2    390
Name: calories, dtype: int64

In [15]:
data = {
    'name': ['John', 'Alice', 'Bob', 'Charlie', 'David'],
    'id': [101, 102, 103, 104, 105],
    'address': ['123 Main St', '456 Oak St', '789 Pine St', '321 Elm St', '654 Birch St'],
    'subject1_marks': [85.5, 90.0, 78.5, 95.5, 88.0],
    'subject2_marks': [92.0, 88.5, 76.0, 94.0, 90.5]
}

In [16]:
df2 = pd.DataFrame(data)
df2

      name   id       address  subject1_marks  subject2_marks
0     John  101   123 Main St            85.5            92.0
1    Alice  102    456 Oak St            90.0            88.5
2      Bob  103   789 Pine St            78.5            76.0
3  Charlie  104    321 Elm St            95.5            94.0
4    David  105  654 Birch St            88.0            90.5

In [17]:
df2['total'] = df2['subject1_marks'] + df2['subject2_marks']

In [18]:
df2

      name   id       address  subject1_marks  subject2_marks  total
0     John  101   123 Main St            85.5            92.0  177.5
1    Alice  102    456 Oak St            90.0            88.5  178.5
2      Bob  103   789 Pine St            78.5            76.0  154.5
3  Charlie  104    321 Elm St            95.5            94.0  189.5
4    David  105  654 Birch St            88.0            90.5  178.5

In [21]:
df2.iloc[:2, 0:1]

    name
0   John
1  Alice

In [22]:
import numpy as np

In [29]:
total_mean = df2["total"].mean()
total_mean

175.7

# CSV

In [30]:
np.random.seed(42)  # Setting seed for reproducibility
num_records = 30
data = {
    'Name': [f'Person_{i}' for i in range(1, num_records + 1)],
    'ID': np.random.randint(100, 1000, size=num_records),
    'Age': np.random.randint(18, 60, size=num_records),
    'Score1': np.random.uniform(50, 100, size=num_records),
    'Score2': np.random.uniform(50, 100, size=num_records)
}

# Create a Pandas DataFrame
df = pd.DataFrame(data)

# Save the DataFrame to a CSV file
df.to_csv('generated_data.csv', index=False)

In [31]:
df3 = pd.read_csv('demo.csv')
df3

      a     b     c     d
0  10.0  20.0   NaN  30.0
1   NaN  40.0   2.0   NaN
2   1.0   4.0   5.0   6.0
3  50.0   NaN  40.0   NaN
4   NaN   NaN  20.0   NaN
5   NaN   5.0   NaN   7.0
6   7.0   NaN   9.0   NaN

In [32]:
df3.fillna(0)

      a     b     c     d
0  10.0  20.0   0.0  30.0
1   0.0  40.0   2.0   0.0
2   1.0   4.0   5.0   6.0
3  50.0   0.0  40.0   0.0
4   0.0   0.0  20.0   0.0
5   0.0   5.0   0.0   7.0
6   7.0   0.0   9.0   0.0

# Data Normalization

Data normalization is a technique used in data mining to transform the values of a dataset into a common scale. This is important because many machine learning algorithms are sensitive to the scale of the input features and can produce better results when the data is normalized.

### Need of Normalization –
Normalization is generally required when we are dealing with attributes on a different scale, otherwise, it may lead to a dilution in effectiveness of an important equally important attribute(on lower scale) because of other attribute having values on larger scale. In simple words, when multiple attributes are there but attributes have values on different scales, this may lead to poor data models while performing data mining operations. So they are normalized to bring all the attributes on the same scale.

![normalization](normalization.png)

### Min-Max Normalization

![Normalization_formula](min-max-normalization1.png)

Where A is the attribute data, Min(A), Max(A) are the minimum and maximum absolute value of A respectively. v’ is the new value of each entry in data. v is the old value of each entry in data. new_max(A), new_min(A) is the max and min value of the range(i.e boundary value of range required) respectively.